emacs/major-modes/gptel-skills.org
#+title: GPTel Skills System (@Mention-Based)
#+author: Jeff Farr
#+property: header-args:emacs-lisp :tangle gptel-skills.el
#+auto_tangle: y

* Introduction

This module implements a dynamic skills system for gptel that allows explicit skill
activation via =@skill-name= mentions during conversations. Skills are Claude Code skills
from =~/.claude/skills/= that provide context, guidelines, and reference material.

** Architecture Overview

The skills system operates in four phases, each serving a specific purpose in the
@mention-to-injection pipeline:

1. **Discovery** (initialization): Scan skills directory (=~/.claude/skills/= for markdown,
   =~/.org-roam/skills/= for org-roam), parse metadata (name, description, injection-mode)
   with lazy loading. Both skill types are unified in a single registry.

2. **Mention Detection** (typing): As you type in gptel buffers, the system detects
   =@skill-name= patterns, validates against the registry, and creates visual overlays
   with help-echo descriptions. Updates buffer-local active skills list.

3. **Dynamic Injection** (sending): When you press =C-c RET= to send, hooks into
   =gptel-prompt-transform-functions= to:
   - Load skill content (if not cached)
   - Determine injection mode (system/context/user via heuristics or explicit setting)
   - Inject content into appropriate location
   - Strip @mentions from visible prompt

4. **Progressive Disclosure** (optional): Load additional resources referenced within
   skills (currently basic support via =jf/gptel-skills--load-resource=)

** Key Features

- **Explicit activation**: Type =@skill-name= in gptel buffer
- **Visual feedback**: Overlays show active skills (like @mentions)
- **Smart injection**: Content goes to system message, context, or user message
- **Lazy loading**: Skills load on first mention, then cached
- **Completion support**: TAB completion for skill names

** Usage Example

#+begin_example
User types in gptel buffer:
"Help me write elisp @writing-elisp"
                       ^^^^^^^^^^^^^^ <- overlay appears (green underline + description on hover)

User sends (C-c RET):
→ Transform hook detects @writing-elisp
→ Loads skill content (lazy, cached after first load)
→ Analyzes content → determines injection-mode='system (behavioral guidance)
→ Appends to gptel--system-message:
  "\n\n## Skill: writing-elisp\n\n[skill content with elisp best practices]"
→ Strips @mention from prompt (makes invisible)
→ Request sent to LLM with enhanced system message

Result: LLM receives behavioral guidance about elisp without @mention clutter
#+end_example

** System Architecture Diagram

#+begin_example
┌───────────────────────────────────────────────────────────────────────────────────────────────────────┐
│                                         GPTEL SKILLS SYSTEM                                            │
└───────────────────────────────────────────────────────────────────────────────────────────────────────┘

INITIALIZATION (Phase 1: Discovery)
┌─────────────────────────────────────┐     ┌─────────────────────────────────────┐
│ ~/.claude/skills/*/SKILL.md         │     │ ~/.org-roam/skills/*.org            │
│ (Markdown skills)                   │     │ (Org-roam skills)                   │
└────────────┬────────────────────────┘     └────────────┬────────────────────────┘
             │                                            │
             │ jf/gptel-skills--discover()               │ jf/gptel-skills-roam--discover-files()
             │ jf/gptel-skills--parse-metadata()         │ jf/gptel-skills-roam--parse-file-metadata()
             │                                            │
             └────────────────┬───────────────────────────┘
                              ↓
                 ┌────────────────────────────────────────────┐
                 │  jf/gptel-skills--registry (hash table)    │
                 │  Keys: skill-name (string)                 │
                 │  Values: metadata plist                    │
                 │    :name :description :injection-mode      │
                 │    :path/:file :source :loaded :content    │
                 └────────────────────────────────────────────┘

USER INTERACTION (Phase 2: Mention Detection & Visual Feedback)
┌─────────────────────────────────────────────────────────────────────────────────────────────────────┐
│  GPTEL BUFFER (with gptel-mode enabled)                                                             │
│  ┌───────────────────────────────────────────────────────────────────────────────────────────────┐ │
│  │ User prompt: "Help me write elisp @writing-elisp"                                             │ │
│  │                                     ^^^^^^^^^^^^^^^^                                           │ │
│  │                                     │ Overlay with face + help-echo                           │ │
│  └───────────────────────────────────────────────────────────────────────────────────────────────┘ │
└─────────────────────────────────────────────────────────────────────────────────────────────────────┘
                                            ↑
                                            │
                        ┌───────────────────┴────────────────────┐
                        │ after-change-functions hook            │
                        │ jf/gptel-skills--update-overlays()     │
                        │   ├─ detect mentions                   │
                        │   ├─ create overlays                   │
                        │   └─ update jf/gptel-skills--active    │
                        └────────────────────────────────────────┘

SENDING REQUEST (Phase 3: Dynamic Injection)
User presses C-c RET (gptel-send)
             ↓
┌────────────────────────────────────────────────────────────────────────────────────────┐
│ gptel-prompt-transform-functions hook                                                  │
│ jf/gptel-skills--transform-inject(fsm)                                                 │
│   ├─ Detect mentions                                                                   │
│   ├─ Load content (lazy, with caching)                                                 │
│   ├─ Determine injection mode (auto detection or explicit)                             │
│   │   ├─ system:  Content prepended to gptel--system-message                           │
│   │   ├─ context: Content placed in temp buffer, added to gptel-context list           │
│   │   └─ user:    Content inserted at top of prompt buffer                             │
│   └─ Strip @mentions (make invisible)                                                  │
└────────────────────────────────────────────────────────────────────────────────────────┘
             ↓
        Request sent to LLM with skill content injected
#+end_example

* Configuration

Setup lexical binding and dependencies.

#+begin_src emacs-lisp
;; -*- lexical-binding: t; -*-
(require 'cl-lib)
(require 'gptel nil t)
(require 'gptel-skills-roam nil t)
#+end_src

** Customization Variables

#+begin_src emacs-lisp
(defgroup gptel-skills nil
  "Skills system for gptel with @mention activation."
  :group 'gptel
  :prefix "jf/gptel-skills-")

(defcustom jf/gptel-skills-directory "~/.claude/skills"
  "Directory containing Claude Code skills.
Skills should be organized as SKILL-NAME/SKILL.md."
  :type 'directory
  :group 'gptel-skills)

(defcustom jf/gptel-skills-mention-prefix "@"
  "Prefix character for skill mentions in buffer."
  :type 'string
  :group 'gptel-skills)

(defcustom jf/gptel-skills-strip-mentions t
  "Whether to strip @mentions from prompt before sending.
If nil, mentions are kept in the prompt (visible to LLM)."
  :type 'boolean
  :group 'gptel-skills)

(defcustom jf/gptel-skills-auto-expand nil
  "Automatically load referenced resources without prompting."
  :type 'boolean
  :group 'gptel-skills)

(defcustom jf/gptel-skills-verbose nil
  "When non-nil, print verbose messages during skill operations."
  :type 'boolean
  :group 'gptel-skills)
#+end_src

** Face Definitions

#+begin_src emacs-lisp
(defface jf/gptel-skills-mention-face
  '((t :inherit font-lock-keyword-face :underline t))
  "Face for @skill mentions in gptel buffers.")
#+end_src

* Data Structures

#+begin_src emacs-lisp
(defvar jf/gptel-skills--registry (make-hash-table :test 'equal)
  "Hash table mapping skill names to metadata plists.

This registry contains both markdown (.md) and org-roam skills.

Each entry is a plist with keys:
  :name          - Skill name (string)
  :description   - Description for completion/help (string)
  :path          - Full path to SKILL.md file (string) [markdown only]
  :dir           - Skill directory path (string) [markdown only]
  :file          - Full path to .org skill file (string) [org-roam only]
  :source        - Source type: 'markdown or 'org-roam (symbol)
  :injection-mode - Where to inject: system|context|user|auto (symbol)
  :loaded        - Whether content has been loaded (boolean)
  :content       - Cached skill content (string or nil)")

(defvar-local jf/gptel-skills--active nil
  "List of skill names active in current buffer via @mentions.")

(defvar-local jf/gptel-skills--overlays nil
  "List of skill mention overlays in current buffer.")
#+end_src

** Component Relationships Diagram

#+begin_example
┌─────────────────────────────────────────────────────────────────────────────────────────────────────┐
│                                   COMPONENT RELATIONSHIP DIAGRAM                                     │
└─────────────────────────────────────────────────────────────────────────────────────────────────────┘

CORE DATA STRUCTURES
┌───────────────────────────────────────────────┐
│ jf/gptel-skills--registry (hash table)        │
│   Populated by:                               │
│   • jf/gptel-skills--discover()               │
│   • jf/gptel-skills--parse-metadata()         │
│   • jf/gptel-skills-roam--discover-files()    │
│   • jf/gptel-skills-roam--parse-file-metadata()│
│                                                │
│   Queried by:                                  │
│   • jf/gptel-skills--detect-mentions()        │
│   • jf/gptel-skills--completion-at-point()    │
│   • jf/gptel-skills--transform-inject()       │
│                                                │
│   Modified by:                                 │
│   • jf/gptel-skills--transform-inject()       │
│     (loads content, updates :loaded/:content) │
└───────────────────────────────────────────────┘
                    ↓
┌───────────────────────────────────────────────┐
│ jf/gptel-skills--active (buffer-local list)   │
│   Updated by:                                  │
│   • jf/gptel-skills--update-overlays()        │
│                                                │
│   Used by:                                     │
│   • jf/gptel-skills-list-active()             │
└───────────────────────────────────────────────┘
                    ↓
┌───────────────────────────────────────────────┐
│ jf/gptel-skills--overlays (buffer-local list) │
│   Updated by:                                  │
│   • jf/gptel-skills--add-overlay()            │
│   • jf/gptel-skills--update-overlays()        │
│                                                │
│   Cleared by:                                  │
│   • jf/gptel-skills-clear-mentions()          │
│   • jf/gptel-skills-reload()                  │
└───────────────────────────────────────────────┘

HOOK INTEGRATION
┌────────────────────────────────────────────────────────────────────────────────────────┐
│ gptel-mode enabled                                                                     │
│   ├─ gptel-mode-hook                                                                   │
│   │   ├─ after-change-functions ← jf/gptel-skills--update-overlays()                  │
│   │   └─ completion-at-point-functions ← jf/gptel-skills--completion-at-point()       │
│   │                                                                                     │
│   └─ gptel-prompt-transform-functions ← jf/gptel-skills--transform-inject(fsm)        │
└────────────────────────────────────────────────────────────────────────────────────────┘
#+end_example

* Discovery and Parsing (Phase 1)

** Discover Skills

#+begin_src emacs-lisp
(defun jf/gptel-skills--discover ()
  "Scan skills directory and return list of SKILL.md file paths.
Returns list of absolute paths to SKILL.md files."
  (let ((skills-dir (expand-file-name jf/gptel-skills-directory)))
    (when (file-directory-p skills-dir)
      (let ((skill-files '()))
        (dolist (entry (directory-files skills-dir t "^[^.]" t))
          (when (file-directory-p entry)
            (let ((skill-file (expand-file-name "SKILL.md" entry)))
              (when (file-exists-p skill-file)
                (push skill-file skill-files)))))
        (nreverse skill-files)))))
#+end_src

