emacs/major-modes/gptel-skills.org
** Completion at Point

#+begin_src emacs-lisp
(defun jf/gptel-skills--completion-at-point ()
  "Provide completion for @skill mentions.
Integrates with completion-at-point-functions."
  (when (and (bound-and-true-p gptel-mode)  ; gptel-mode is a minor mode
             (> (hash-table-count jf/gptel-skills--registry) 0))
    (let* ((prefix (regexp-quote jf/gptel-skills-mention-prefix))
           (bounds (bounds-of-thing-at-point 'symbol))
           (start (and bounds (car bounds)))
           (end (and bounds (cdr bounds))))
      ;; Check if we're after @ prefix
      (when (and start
                 (> start (point-min))
                 (string= (buffer-substring-no-properties (1- start) start)
                          jf/gptel-skills-mention-prefix))
        (list (1- start)  ; include the @
              end
              (mapcar (lambda (name)
                       (concat jf/gptel-skills-mention-prefix name))
                     (hash-table-keys jf/gptel-skills--registry))
              :exclusive 'no
              :annotation-function
              (lambda (candidate)
                (let* ((skill-name (substring candidate (length jf/gptel-skills-mention-prefix)))
                       (metadata (gethash skill-name jf/gptel-skills--registry))
                       (mode (plist-get metadata :injection-mode))
                       (source (plist-get metadata :source)))
                  (format " (%s %s)"
                          (or mode 'auto)
                          (cond
                           ((eq source 'org-roam) "org-roam")
                           ((eq source 'markdown) "md")
                           (t ""))))))))))
#+end_src

** Injection Strategy Decision Tree

#+begin_example
┌─────────────────────────────────────────────────────────────────────────────────────────────────────┐
│                             INJECTION MODE DETERMINATION FLOWCHART                                   │
└─────────────────────────────────────────────────────────────────────────────────────────────────────┘

jf/gptel-skills--transform-inject()
            ↓
    Get skill metadata from registry
            ↓
    ┌───────────────────────┐
    │ Injection mode set?   │
    └───────┬───────────────┘
            │
   ┌────────┴────────┐
   │                 │
  YES               NO (mode = 'auto)
   │                 │
   │                 ↓
   │     jf/gptel-skills--determine-injection-mode(metadata, content)
   │                 │
   │        ┌────────┴───────────────────────────────────────┐
   │        │ Content starts with:                           │
   │        │ "You are", "When", "Always", "Never"?          │
   │        └────┬───────────────────────────────────────┬───┘
   │            YES                                      NO
   │             │                                        │
   │             ↓                                        ↓
   │          'system                        ┌──────────────────────────┐
   │                                         │ Content has code blocks, │
   │                                         │ tables, or >1000 chars?  │
   │                                         └────┬─────────────────┬───┘
   │                                             YES               NO
   │                                              │                 │
   │                                              ↓                 ↓
   │                                          'context      ┌──────────────┐
   │                                                        │ Numbered     │
   │                                                        │ list "1."?   │
   │                                                        └───┬──────┬───┘
   │                                                           YES    NO
   │                                                            │      │
   │                                                            ↓      ↓
   │                                                          'user  'system
   │                                                                   │
   └───────────────────────────────────────────────────────────────────┘
                                    ↓
                    jf/gptel-skills--inject-content(content, mode, skill-name)
                                    │
          ┌─────────────────────────┼─────────────────────────┐
          │                         │                          │
      mode='system             mode='context              mode='user
          │                         │                          │
          ↓                         ↓                          ↓
   Append to               Create temp buffer          Insert at buffer start
   gptel--system-message   Add to gptel-context        with "## Reference:" header
   with "## Skill:" header
#+end_example

* Dynamic Injection (Phase 3)

** Understanding the Transform Hook and FSM

The gptel-skills system integrates with gptel through the =gptel-prompt-transform-functions=
hook, which provides a powerful extension point for modifying requests before they're sent
to the LLM.

*** What is the FSM?

FSM is a finite state machine object (gptel-fsm) created by =gptel-request.el= that tracks
the complete lifecycle of an LLM request. It's passed to all transform functions to provide:

- Access to request metadata via =(gptel-fsm-info fsm)=
- Context about where the request originated
- Information about the target backend and model
- The temporary buffer containing the prompt text

*** Hook Execution Context

When =gptel-prompt-transform-functions= runs:

1. A temporary buffer is created containing the prompt text
2. The hook runs IN THIS TEMP BUFFER with point at the end of the prompt
3. Buffer-local variables from the originating buffer are accessible
4. Transform functions can modify the temp buffer content
5. Transform functions can modify buffer-local variables like:
   - =gptel--system-message= (prepend to system instructions)
   - =gptel-context= (add additional context buffers/files)

*** FSM Info Structure

The FSM contains a plist accessible via =(gptel-fsm-info fsm)=:

| Key | Type | Description |
|-----|------|-------------|
| =:buffer= | buffer | Original gptel buffer where request was initiated |
| =:backend= | gptel-backend | Active LLM backend (Anthropic, OpenAI, etc) |
| =:data= | buffer | Temporary buffer containing prompt text to send |
| =:position= | integer | Position in original buffer |
| =:stream= | boolean | Whether streaming is enabled |
| =:system= | string | System message for this request |

*** Transform Function Contract

Transform functions in =gptel-prompt-transform-functions= can be:

*Synchronous* (1 argument):
#+begin_src emacs-lisp
(defun my-transform (fsm)
  "Transform function that runs and completes immediately."
  ;; Modify temp buffer or variables
  ;; No return value needed
  )
#+end_src

*Asynchronous* (2 arguments):
#+begin_src emacs-lisp
(defun my-async-transform (callback fsm)
  "Transform function that may need to wait for external operations."
  ;; Do async work
  ;; Call (funcall callback) when done
  )
#+end_src

*** What jf/gptel-skills--transform-inject Does

1. Detects @mentions in the temp buffer
2. Loads skill content (lazy loading with caching)
3. Determines injection mode (system/context/user)
4. Modifies the appropriate variable:
   - System mode: Appends to =gptel--system-message=
   - Context mode: Creates temp buffer, adds to =gptel-context=
   - User mode: Inserts content at top of temp buffer
5. Strips @mentions from the temp buffer (makes them invisible)

The transform function does NOT return anything - it modifies state in place.

** Transform Inject

#+begin_src emacs-lisp
(defun jf/gptel-skills--transform-inject (fsm)
  "Main prompt transform function for injecting skills.
Detects @mentions, loads content, determines injection mode, and injects.
Added to gptel-prompt-transform-functions. FSM is the state machine."
  (when (> (hash-table-count jf/gptel-skills--registry) 0)
    ;; Always detect mentions directly - don't rely on jf/gptel-skills--active
    ;; since that depends on overlays which might not be set up yet
    (let ((mentions (jf/gptel-skills--detect-mentions)))
      (when mentions
        (dolist (mention mentions)
          (let* ((skill-name (car mention))
                 (metadata (gethash skill-name jf/gptel-skills--registry)))
            (when metadata
              ;; Load content if not already loaded
              (unless (plist-get metadata :loaded)
                (let* ((source (plist-get metadata :source))
                       (content (cond
                                 ;; Markdown skills - use existing parser
                                 ((eq source 'markdown)
                                  (jf/gptel-skills--parse-content (plist-get metadata :path)))
                                 ;; Org-roam skills - read file directly
                                 ((eq source 'org-roam)
                                  (let ((file (plist-get metadata :file)))
                                    (when (and file (file-exists-p file))
                                      (with-temp-buffer
                                        (insert-file-contents file)
                                        (buffer-string)))))
                                 (t nil))))
                  (when content
                    (plist-put metadata :loaded t)
                    (plist-put metadata :content content)
                    (puthash skill-name metadata jf/gptel-skills--registry))))

              ;; Get content and determine injection mode
              (let ((content (plist-get metadata :content)))
                (when content
                  (let* ((mode-specified (plist-get metadata :injection-mode))
                         (mode (if (eq mode-specified 'auto)
                                  (jf/gptel-skills--determine-injection-mode metadata content)
                                mode-specified)))

                    (when mode
                      (when jf/gptel-skills-verbose
                        (message "Injecting skill: %s (mode: %s)" skill-name mode))

                      ;; Inject based on mode
                      (jf/gptel-skills--inject-content content mode skill-name))))))))

        ;; Strip @mentions if configured
        (when jf/gptel-skills-strip-mentions
          (jf/gptel-skills--strip-mentions))))))
#+end_src

** Determine Injection Mode

#+begin_src emacs-lisp
(defun jf/gptel-skills--determine-injection-mode (metadata content)
  "Analyze CONTENT and determine best injection mode.
Returns symbol: system, context, or user."
  ;; Simple heuristic analysis
  (cond
   ;; Behavioral guidelines → system
   ((string-match-p "^\\(You are\\|When \\|Always \\|Never \\)" content)
    'system)

   ;; Has code blocks, tables, references → context
   ((or (string-match-p "```" content)
        (string-match-p "^|.*|$" content)
        (> (length content) 1000))
    'context)

   ;; Has numbered steps, immediate instructions → user
   ((string-match-p "^[0-9]+\\." content)
    'user)

   ;; Default: system (behavioral guidance)
   (t 'system)))
#+end_src

*** Injection Mode Determination: Detailed Explanation

When a skill's =injection-mode= is set to =auto=, the system analyzes the content
to determine the best placement. This section explains the heuristics and reasoning.

