emacs/major-modes/gptel-skills.el
  "Provide completion for @skill mentions.
Integrates with completion-at-point-functions."
  (when (and (bound-and-true-p gptel-mode)  ; gptel-mode is a minor mode
             (> (hash-table-count jf/gptel-skills--registry) 0))
    (let* ((prefix (regexp-quote jf/gptel-skills-mention-prefix))
           (bounds (bounds-of-thing-at-point 'symbol))
           (start (and bounds (car bounds)))
           (end (and bounds (cdr bounds))))
      ;; Check if we're after @ prefix
      (when (and start
                 (> start (point-min))
                 (string= (buffer-substring-no-properties (1- start) start)
                          jf/gptel-skills-mention-prefix))
        (list (1- start)  ; include the @
              end
              (mapcar (lambda (name)
                       (concat jf/gptel-skills-mention-prefix name))
                     (hash-table-keys jf/gptel-skills--registry))
              :exclusive 'no
              :annotation-function
              (lambda (candidate)
                (let* ((skill-name (substring candidate (length jf/gptel-skills-mention-prefix)))
                       (metadata (gethash skill-name jf/gptel-skills--registry))
                       (source (plist-get metadata :source)))
                  (cond
                   ((eq source 'org-roam) " (org-roam)")
                   ((eq source 'markdown) " (md)")
                   (t "")))))))))

(defun my-transform (fsm)
  "Transform function that runs and completes immediately."
  ;; Modify temp buffer or variables
  ;; No return value needed
  )

(defun my-async-transform (callback fsm)
  "Transform function that may need to wait for external operations."
  ;; Do async work
  ;; Call (funcall callback) when done
  )

(defun jf/gptel-skills--transform-inject (fsm)
  "Main prompt transform function for injecting skills.
Detects @mentions, loads content, and injects to system message.
Added to gptel-prompt-transform-functions. FSM is the state machine."
  (when (> (hash-table-count jf/gptel-skills--registry) 0)
    ;; Always detect mentions directly - don't rely on jf/gptel-skills--active
    ;; since that depends on overlays which might not be set up yet
    (let ((mentions (jf/gptel-skills--detect-mentions)))
      (when mentions
        (dolist (mention mentions)
          (let* ((skill-name (car mention))
                 (metadata (gethash skill-name jf/gptel-skills--registry)))
            (when metadata
              ;; Load content if not already loaded
              (unless (plist-get metadata :loaded)
                (let* ((source (plist-get metadata :source))
                       (content (cond
                                 ;; Markdown skills - use existing parser
                                 ((eq source 'markdown)
                                  (jf/gptel-skills--parse-content (plist-get metadata :path)))
                                 ;; Org-roam skills - read file directly
                                 ((eq source 'org-roam)
                                  (let ((file (plist-get metadata :file)))
                                    (when (and file (file-exists-p file))
                                      (with-temp-buffer
                                        (insert-file-contents file)
                                        (buffer-string)))))
                                 (t nil))))
                  (when content
                    (plist-put metadata :loaded t)
                    (plist-put metadata :content content)
                    (puthash skill-name metadata jf/gptel-skills--registry))))

              ;; Get content and inject to system message
              (let ((content (plist-get metadata :content)))
                (when content
                  (when jf/gptel-skills-verbose
                    (message "Injecting skill: %s" skill-name))
                  ;; Inject to system message
                  (jf/gptel-skills--inject-content content skill-name))))))

        ;; Strip @mentions if configured
        (when jf/gptel-skills-strip-mentions
          (jf/gptel-skills--strip-mentions))))))

(defun jf/gptel-skills--inject-content (content skill-name)
  "Inject CONTENT for SKILL-NAME into system message.
All skills are now injected as system-level behavioral guidelines."
