emacs/major-modes/gptel-skills.org
**** The Three Injection Modes

| Mode | Target | Use Case |
|------|--------|----------|
| =system= | =gptel--system-message= | Behavioral guidelines, persona definition, general rules |
| =context= | =gptel-context= buffers | Reference material, code examples, documentation |
| =user= | Prompt buffer (top) | Immediate instructions, step-by-step procedures |

**** Detection Heuristics (in order of precedence)

**1. Behavioral Directives → system**

Content starting with imperative behavioral language goes to system message:

Examples:
#+begin_example
"You are an expert in Emacs Lisp..."           → system
"When writing elisp, always use..."            → system
"Always prefer higher-order functions..."      → system
"Never use eval unless absolutely necessary"   → system
#+end_example

*Rationale*: These define HOW the LLM should behave across the conversation.
They're meta-instructions about approach, not specific to the current query.

**2. Large Reference Material → context**

Content with substantial reference material goes to context buffers:

Examples:
#+begin_example
"```elisp\n(defun foo ()...```"               → context (code blocks)
"| Function | Description |\n|---|---|"       → context (tables)
"[5000 character API reference]"              → context (>1000 chars)
#+end_example

*Rationale*: Large reference material works better as separate context that
the LLM can reference. Keeps system message focused and avoids cluttering
the user prompt.

**3. Procedural Steps → user**

Content with numbered procedures goes to top of user prompt:

Examples:
#+begin_example
"1. First, analyze the problem\n2. Then..." → user
"1. Create the function\n2. Add tests"      → user
#+end_example

*Rationale*: Step-by-step procedures are immediate instructions for THIS query.
They should appear as part of the user's request, not as system behavior.

**4. Default → system**

Brief guidance text without specific markers:

Examples:
#+begin_example
"Use proper error handling"                  → system (default)
"Prefer immutable data structures"           → system (default)
#+end_example

*Rationale*: General guidance without strong signals defaults to behavioral
instruction (system message) as the safest placement.

**** Edge Cases and Override

Users can override auto-detection by setting =injection-mode= explicitly:

#+begin_example
---
name: my-skill
injection-mode: context  # Force context mode regardless of content
---
#+end_example

This is useful when:
- Auto-detection chooses wrong mode for your use case
- You want consistent behavior regardless of content changes
- You have specific integration requirements

** Inject Content

#+begin_src emacs-lisp
(defun jf/gptel-skills--inject-content (content mode skill-name)
  "Inject CONTENT based on MODE for SKILL-NAME.
MODE is symbol: system, context, or user."
  (pcase mode
    ('system
     ;; Append to system message
     (setq-local gptel--system-message
                (if gptel--system-message
                    (concat gptel--system-message
                            (format "\n\n## Skill: %s\n\n" skill-name)
                            content)
                  (concat (format "## Skill: %s\n\n" skill-name)
                          content))))

    ('context
     ;; Add to gptel-context as a buffer-like source
     (let ((temp-buf (generate-new-buffer (format " *gptel-skill-%s*" skill-name))))
       (with-current-buffer temp-buf
         (insert (format "# Skill: %s\n\n" skill-name))
         (insert content))
       ;; Add to context list
       (setq-local gptel-context
                  (append gptel-context (list temp-buf)))))

    ('user
     ;; Insert directly in prompt buffer at beginning
     (save-excursion
       (goto-char (point-min))
       (insert (format "## Reference: %s\n\n" skill-name))
       (insert content)
       (insert "\n\n---\n\n")))))
#+end_src

*** Injection Examples: Before and After

This section shows concrete examples of how skill content is injected for each mode.

**** System Mode Injection

**Scenario**: Skill contains behavioral guidelines

Before injection:
#+begin_example
gptel--system-message = "You are a helpful assistant"
#+end_example

After =jf/gptel-skills--inject-content= with mode='system:
#+begin_example
gptel--system-message = "You are a helpful assistant

## Skill: writing-elisp

Always use lexical binding. Prefer higher-order functions.
Use cl-lib instead of deprecated cl package. Include docstrings
for all public functions."
#+end_example

**Result**: Behavioral guidance is appended to system message, influencing all
responses in the conversation.

**** Context Mode Injection

**Scenario**: Skill contains large reference material or code examples

Before injection:
#+begin_example
gptel-context = (buffer1 buffer2)
#+end_example

After =jf/gptel-skills--inject-content= with mode='context:
#+begin_example
gptel-context = (buffer1 buffer2 *gptel-skill-writing-elisp*)

Contents of *gptel-skill-writing-elisp* buffer:
# Skill: writing-elisp

```elisp
(defun example-function ()
  (let* ((x 1) (y 2))
    (+ x y)))
```

Common patterns:
| Pattern | Example | Use case |
|---------|---------|----------|
| ...
#+end_example

**Result**: Reference material is sent as separate context buffer, allowing LLM
to reference it without cluttering system message or user prompt.

**** User Mode Injection

**Scenario**: Skill contains immediate procedural instructions

Buffer content before injection:
#+begin_example
"Help me write elisp @writing-elisp"
#+end_example

After =jf/gptel-skills--inject-content= with mode='user:
#+begin_example
"## Reference: writing-elisp

1. Start with lexical binding declaration
2. Add docstrings to public functions
3. Use cl-lib for advanced features
4. Test incrementally

---

Help me write elisp @writing-elisp"
#+end_example

**Result**: Procedural steps appear at top of user prompt as immediate
instructions for this specific query.

** Strip Mentions

#+begin_src emacs-lisp
(defun jf/gptel-skills--strip-mentions ()
  "Remove or hide @mentions from prompt buffer.
Uses invisible text property to hide mentions."
  (save-excursion
    (goto-char (point-min))
    (let ((prefix (regexp-quote jf/gptel-skills-mention-prefix)))
      (while (re-search-forward (concat prefix "\\([a-zA-Z0-9_-]+\\)") nil t)
        (let ((skill-name (match-string 1)))
          ;; Only strip if skill is in registry
          (when (gethash skill-name jf/gptel-skills--registry)
            ;; Make invisible
            (put-text-property (match-beginning 0) (match-end 0)
                              'invisible 'gptel-skill)))))))
#+end_src

* Interactive Commands (Phase 5)

** Insert Mention

#+begin_src emacs-lisp
(defun jf/gptel-skills-insert-mention (skill-name)
  "Insert @mention for SKILL-NAME at point.
Prompts for skill using completing-read."
  (interactive
   (list (completing-read "Insert skill: "
                         (hash-table-keys jf/gptel-skills--registry)
                         nil t)))
  (insert jf/gptel-skills-mention-prefix skill-name)
  ;; Trigger overlay update
  (jf/gptel-skills--update-overlays))
#+end_src

** List Active Skills

#+begin_src emacs-lisp
(defun jf/gptel-skills-list-active ()
  "Display currently active skills in minibuffer or buffer."
  (interactive)
  (if (null jf/gptel-skills--active)
      (message "No active skills in current buffer")
    (let ((skill-info
           (mapcar (lambda (name)
                    (let* ((metadata (gethash name jf/gptel-skills--registry))
                           (mode (plist-get metadata :injection-mode)))
                      (format "%s (%s)" name mode)))
                  jf/gptel-skills--active)))
      (message "Active skills: %s" (string-join skill-info ", ")))))
#+end_src

** Clear Mentions

#+begin_src emacs-lisp
(defun jf/gptel-skills-clear-mentions ()
  "Remove all @mentions from buffer."
  (interactive)
  (when (yes-or-no-p "Remove all @skill mentions from buffer? ")
    (save-excursion
      (goto-char (point-min))
      (let ((prefix (regexp-quote jf/gptel-skills-mention-prefix)))
        (while (re-search-forward (concat prefix "\\([a-zA-Z0-9_-]+\\)") nil t)
          (let ((skill-name (match-string 1)))
            (when (gethash skill-name jf/gptel-skills--registry)
              (delete-region (match-beginning 0) (match-end 0))
              ;; Clean up extra spaces
              (when (looking-at " +")
                (delete-region (point) (match-end 0))))))))
    (jf/gptel-skills--update-overlays)
    (message "Cleared all skill mentions")))
#+end_src

