emacs/major-modes/gptel-skills.el
  "Reload all skills from directory and org-roam.
Clears cache, re-scans directory, and updates registry with both
markdown and org-roam skills."
  (interactive)

  ;; Clear registry
  (clrhash jf/gptel-skills--registry)

  ;; Discover markdown skills
  (let ((skill-files (jf/gptel-skills--discover))
        (md-count 0))
    (if (null skill-files)
        (message "No markdown skills found in %s" jf/gptel-skills-directory)

      ;; Parse and register each markdown skill
      (dolist (skill-file skill-files)
        (let ((metadata (jf/gptel-skills--parse-metadata skill-file)))
          (when metadata
            (let ((name (plist-get metadata :name)))
              (puthash name metadata jf/gptel-skills--registry)
              (setq md-count (1+ md-count)))))))

    ;; Try to load org-roam skills module if not already loaded
    (unless (featurep 'gptel-skills-roam)
      (let ((roam-skills-file (expand-file-name "gptel-skills-roam.el"
                                                 (file-name-directory (or load-file-name
                                                                         buffer-file-name)))))
        (when (file-exists-p roam-skills-file)
          (message "Loading org-roam skills from: %s" roam-skills-file)
          (load roam-skills-file nil t))))

    ;; Discover and register org-roam skills
    (message "Checking org-roam skills: featurep=%s enabled=%s"
             (featurep 'gptel-skills-roam)
             (if (boundp 'jf/gptel-skills-roam-enabled)
                 jf/gptel-skills-roam-enabled
               "unbound"))
    (when (and (featurep 'gptel-skills-roam)
               (boundp 'jf/gptel-skills-roam-enabled)
               jf/gptel-skills-roam-enabled)
      (let ((skill-files (jf/gptel-skills-roam--discover-files))
            (roam-count 0))
        (message "Skill files discovered: %s" skill-files)
        (dolist (file skill-files)
          (let ((metadata (jf/gptel-skills-roam--parse-file-metadata file)))
            (when metadata
              (let ((skill-name (plist-get metadata :name)))
                (message "Loaded org-roam skill: %s from %s" skill-name file)
                ;; Use skill name as key in unified registry
                (puthash skill-name metadata jf/gptel-skills--registry)
                (setq roam-count (1+ roam-count))))))
        (message "Loaded %d org-roam skill(s)" roam-count)))

    (message "Loaded %d skill(s) total (%d markdown, %d org-roam)"
             (hash-table-count jf/gptel-skills--registry)
             md-count
             (if (and (featurep 'gptel-skills-roam) jf/gptel-skills-roam-enabled)
                 (- (hash-table-count jf/gptel-skills--registry) md-count)
               0)))

  ;; Update overlays in all gptel buffers
  (dolist (buf (buffer-list))
    (with-current-buffer buf
      (when (bound-and-true-p gptel-mode)  ; gptel-mode is a minor mode
        (jf/gptel-skills--update-overlays)))))

(defun jf/gptel-skills-describe (skill-name)
  "Show description and metadata for SKILL-NAME."
  (interactive
   (list (completing-read "Describe skill: "
                         (hash-table-keys jf/gptel-skills--registry)
                         nil t)))
  (let ((metadata (gethash skill-name jf/gptel-skills--registry)))
    (if (not metadata)
        (message "Skill not found: %s" skill-name)
      (with-output-to-temp-buffer (format "*Skill: %s*" skill-name)
        (princ (format "Skill: %s\n\n" skill-name))
        (princ (format "Description: %s\n" (plist-get metadata :description)))
        (princ (format "Path: %s\n" (plist-get metadata :path)))
        (princ (format "Loaded: %s\n" (if (plist-get metadata :loaded) "yes" "no")))
        (when (plist-get metadata :loaded)
          (princ (format "\nContent length: %d characters\n"
                        (length (plist-get metadata :content)))))))))

(defun jf/gptel-skills-setup ()
  "Initialize the skills system.
Called automatically when this module is loaded."
  (when (file-directory-p (expand-file-name jf/gptel-skills-directory))
    (jf/gptel-skills-reload)

    ;; Setup hooks for existing gptel buffers
    (dolist (buf (buffer-list))
      (with-current-buffer buf
        (when (bound-and-true-p gptel-mode)  ; gptel-mode is a minor mode
          ;; Install buffer-local hooks
          (add-hook 'after-change-functions
                    #'jf/gptel-skills--update-overlays nil t)
          (add-hook 'completion-at-point-functions
                    #'jf/gptel-skills--completion-at-point nil t)
          ;; Initial overlay update
          (jf/gptel-skills--update-overlays))))))

;; Initialize skills and setup hooks when gptel is loaded
(with-eval-after-load 'gptel
  ;; Load skills
  (jf/gptel-skills-setup)

  ;; Add transform function to gptel
  (add-hook 'gptel-prompt-transform-functions
            #'jf/gptel-skills--transform-inject)

  ;; Add buffer-local hooks for gptel buffers
  (add-hook 'gptel-mode-hook
            (lambda ()
              ;; Update overlays on buffer changes
              (add-hook 'after-change-functions
                        #'jf/gptel-skills--update-overlays nil t)
              ;; Enable completion
              (add-hook 'completion-at-point-functions
                        #'jf/gptel-skills--completion-at-point nil t))))

;; If gptel is already loaded, initialize now
(when (featurep 'gptel)
  (jf/gptel-skills-setup))

;; Define keybindings in gptel-mode
(with-eval-after-load 'gptel
  (when (boundp 'gptel-mode-map)
    (define-key gptel-mode-map (kbd "C-c @ i") 'jf/gptel-skills-insert-mention)
    (define-key gptel-mode-map (kbd "C-c @ l") 'jf/gptel-skills-list-active)
    (define-key gptel-mode-map (kbd "C-c @ c") 'jf/gptel-skills-clear-mentions)
    (define-key gptel-mode-map (kbd "C-c @ d") 'jf/gptel-skills-describe)
    (define-key gptel-mode-map (kbd "C-c @ r") 'jf/gptel-skills-reload)))

(provide 'gptel-skills)
;;; gptel-skills.el ends here
